.src/旧笔记(163)/000/project-exhibition.org
#+TITLE: Project Exhibition



* 二学期项目展 <班级赛>

日期:
- 开始: 2020年 8 月10日 <周一>
- 展示: 2020年 8 月20日 <周四>

最终成绩:
|    小组 | 组长   | 项目             | 分数 |
|---------+--------+------------------+------|
| <<<8>>> | 易炜欣 | 小熊便利店       | 9.14 |
|       5 | 邱志鹏 | 耳遇             | 7.57 |
| <<<3>>> | 龚远东 | 潮流网店购物平台 | 7.57 |
|       7 | 曾铭扬 | 飞梦视播         | 7.29 |
|       2 | 黄敏杰 | 花店             | 6.71 |
|       4 | 曾广延 | 史努比购物       | 6.00 |
|       6 | 林涛   | 哪都通旅游       | 4.43 |
|       1 | 闭杨杨 | 二手数码         | 4.00 |

相关文档:
- [[file:../asset/PPT/第五组-耳遇.pptx][第五组的 PPT]]
- [[file:../asset/PPT/第八组-小熊便利店.pptx][第八组的 PPT]]

小结:
- 取长补短，从别人的亮点去吸取经验
- 发现问题，建立正确的解决问题的思考观
- 建立信心，只要做了就可能有结果
- 归零，从现在开始，继续努力
- 持续，项目展结束了，项目还没有结束

* 二学期项目展 <年级赛>

主题: 彰显最好的自己
日期: <2020-09-11 Fri>

参赛队伍:
- 第 8 组
- 第 3 组

记录:
- <2020-09-01 Tue>, 在第 5 组和第 3 组中进行选择，结果第 3 组以 17:12 的微小优势胜出

* 二学年项目展 <准备>
** 示例

- Vue 音乐平台: https://blog.csdn.net/kzj0916/article/details/108663177
- Vue 仿猫眼: https://blog.csdn.net/Web_Struggle/article/details/85340402
- Vue 商城: https://blog.csdn.net/weixin_33873846/article/details/91434336?utm_medium=distribute.pc_relevant_bbs_down.none-task-blog-baidujs-2.nonecase&depth_1-utm_source=distribute.pc_relevant_bbs_down.none-task-blog-baidujs-2.nonecase
- Vue 仿小米商城: https://zhuanlan.zhihu.com/p/78088536
- Vue 项目管理系统: https://cloud.tencent.com/developer/article/1345394

** 需求文档

- https://wenku.baidu.com/view/bd4813c958fb770bf78a55f6.html
  

* 二学年项目展 <班级预展>

2021.1.22 <周五>
  
** 第一组: 海角论坛 (2.57)

- 只展示了 PPT，据说是因为投影仪接口问题
- 完成度不高

** 第二组: 弃权?

???????????????

** 第三组: 唯耳音乐 (4.42)

功能:
+ 游客 / 普通用户 / VIP 用户
+ (音乐/视频) 播放、收藏、评论、关注、付费功能、资源管理

点评:
+ 需求文档/概要设计缺乏？明确做项目的目的、步骤
+ 团队项目，要达到团队协作的目的和效果
+ 细节需要完善，多借鉴相关竞品的产品设计 (站在巨人的肩膀上)
+ 掌控好展示时间

** 第四组: 校园墙 (2.28)

- 只有简陋的原型图？代码没落实
- 展示相当于什么都没展示

** 第五组: 耳遇 (3.57)

+ PPT 做的比较漂亮
+ 功能设计比较丰富 (专栏、MV、综艺、歌单等)
+ 口头禅: 这里有 xxx 什么的
+ 代码呢

** 第六组: 万国书店 (3.71)

- 万国太大，项目太小；需要做好后续
- 看起来需求是下过功夫的，但还是过于简单，并且功能缺失严重
- 应多借鉴其他的书籍网站

** 第七组: 八戒蛋糕 (2.14)

- 需求分析是个啥？
- 时间都去哪儿了？

** 第八组: 有问必答 (3.14)

- 展示不够完善






* 二学年项目展 <班级展>

时间: 2021.03.01 <星期一>

** 第一组: 海角论坛

只有 PPT? 完成度不高? 没有转接头?

** 第二组: ???

只有登录和注册...这不叫项目!

** 第三组: 唯耳音乐

- 流程需要全面 (技术介绍、文档展示等)
- 讲解逻辑需要组织
- 讲解和展示需要默契
- 细节需要完善
  + 共 '8' 条评论: 页面中文字不要用引号
  + 分页尽量不要放到上面
  + 没有权限访问的功能，菜单不需要显示出来

** 第四组: 校园墙

- 要按流程来: PPT、文档、展示...
- ??????????????????????????????????????????

** 第五组: 耳遇

- 。。。only ppt? only document?

** 第六组: 万国书店

- ppt 中错误: gosn -> gson
- 需求文档，严肃的，白纸黑字
- 演讲逻辑乱; 演讲和展示不够默契
- 网页的主题颜色，用黑色，不要用灰色 (白纸黑字)
- 展示的正式场合，对一些数据进行稍微过滤，一些不太合适的内容删掉
- 有些页面太粗糙了

** 第七组: 蛋糕

代码没到 ??????????????????????????????????????

** 第八组: 有问必答

....................................................
....................................................
....................................................
....................................................
