html/0-163-notes/000/project-exhibition.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-05-20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Project Exhibition</title>
<meta name="generator" content="Org mode">
<meta name="author" content="悟饭">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">Project Exhibition</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb19efd1">1. 二学期项目展 &lt;班级赛&gt;</a></li>
<li><a href="#org6ceadbe">2. 二学期项目展 &lt;年级赛&gt;</a></li>
<li><a href="#orga95f68b">3. 二学年项目展 &lt;准备&gt;</a>
<ul>
<li><a href="#org5b8e7a4">3.1. 示例</a></li>
<li><a href="#org4ff133a">3.2. 需求文档</a></li>
</ul>
</li>
<li><a href="#org634d8f7">4. 二学年项目展 &lt;班级预展&gt;</a>
<ul>
<li><a href="#orgbd6342f">4.1. 第一组: 海角论坛 (2.57)</a></li>
<li><a href="#orge66b222">4.2. 第二组: 弃权?</a></li>
<li><a href="#org445c768">4.3. 第三组: 唯耳音乐 (4.42)</a></li>
<li><a href="#org0adfd43">4.4. 第四组: 校园墙 (2.28)</a></li>
<li><a href="#org8018482">4.5. 第五组: 耳遇 (3.57)</a></li>
<li><a href="#orgeb13130">4.6. 第六组: 万国书店 (3.71)</a></li>
<li><a href="#org153bf64">4.7. 第七组: 八戒蛋糕 (2.14)</a></li>
<li><a href="#org610a193">4.8. 第八组: 有问必答 (3.14)</a></li>
</ul>
</li>
<li><a href="#org692ead6">5. 二学年项目展 &lt;班级展&gt;</a>
<ul>
<li><a href="#org1e38889">5.1. 第一组: 海角论坛</a></li>
<li><a href="#org9250c5b">5.2. 第二组: ???</a></li>
<li><a href="#orgdf2f8b3">5.3. 第三组: 唯耳音乐</a></li>
<li><a href="#org4234c58">5.4. 第四组: 校园墙</a></li>
<li><a href="#org0362248">5.5. 第五组: 耳遇</a></li>
<li><a href="#org3f57775">5.6. 第六组: 万国书店</a></li>
<li><a href="#org29d3d6f">5.7. 第七组: 蛋糕</a></li>
<li><a href="#orgd1fec31">5.8. 第八组: 有问必答</a></li>
</ul>
</li>
</ul>
</div>
</nav>



<section id="outline-container-orgb19efd1" class="outline-2">
<h2 id="orgb19efd1"><span class="section-number-2">1.</span> 二学期项目展 &lt;班级赛&gt;</h2>
<div class="outline-text-2" id="text-1">
<p>
日期:
</p>
<ul class="org-ul">
<li>开始: 2020年 <a href="#org41c6646">8</a> 月10日 &lt;周一&gt;</li>
<li>展示: 2020年 <a href="#org41c6646">8</a> 月20日 &lt;周四&gt;</li>
</ul>

<p>
最终成绩:
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">小组</th>
<th scope="col" class="org-left">组长</th>
<th scope="col" class="org-left">项目</th>
<th scope="col" class="org-right">分数</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right"><a id="org41c6646">8</a></td>
<td class="org-left">易炜欣</td>
<td class="org-left">小熊便利店</td>
<td class="org-right">9.14</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">邱志鹏</td>
<td class="org-left">耳遇</td>
<td class="org-right">7.57</td>
</tr>

<tr>
<td class="org-right"><a id="org924fc76">3</a></td>
<td class="org-left">龚远东</td>
<td class="org-left">潮流网店购物平台</td>
<td class="org-right">7.57</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">曾铭扬</td>
<td class="org-left">飞梦视播</td>
<td class="org-right">7.29</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">黄敏杰</td>
<td class="org-left">花店</td>
<td class="org-right">6.71</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">曾广延</td>
<td class="org-left">史努比购物</td>
<td class="org-right">6.00</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">林涛</td>
<td class="org-left">哪都通旅游</td>
<td class="org-right">4.43</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">闭杨杨</td>
<td class="org-left">二手数码</td>
<td class="org-right">4.00</td>
</tr>
</tbody>
</table>

<p>
相关文档:
</p>
<ul class="org-ul">
<li><a href="../asset/PPT/第五组-耳遇.pptx">第五组的 PPT</a></li>
<li><a href="../asset/PPT/第八组-小熊便利店.pptx">第八组的 PPT</a></li>
</ul>

<p>
小结:
</p>
<ul class="org-ul">
<li>取长补短，从别人的亮点去吸取经验</li>
<li>发现问题，建立正确的解决问题的思考观</li>
<li>建立信心，只要做了就可能有结果</li>
<li>归零，从现在开始，继续努力</li>
<li>持续，项目展结束了，项目还没有结束</li>
</ul>
</div>
</section>

<section id="outline-container-org6ceadbe" class="outline-2">
<h2 id="org6ceadbe"><span class="section-number-2">2.</span> 二学期项目展 &lt;年级赛&gt;</h2>
<div class="outline-text-2" id="text-2">
<p>
主题: 彰显最好的自己
日期: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-11 Fri&gt;</span></span>
</p>

<p>
参赛队伍:
</p>
<ul class="org-ul">
<li>第 <a href="#org41c6646">8</a> 组</li>
<li>第 <a href="#org924fc76">3</a> 组</li>
</ul>

<p>
记录:
</p>
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-01 Tue&gt;</span></span>, 在第 5 组和第 <a href="#org924fc76">3</a> 组中进行选择，结果第 <a href="#org924fc76">3</a> 组以 17:12 的微小优势胜出</li>
</ul>
</div>
</section>

<section id="outline-container-orga95f68b" class="outline-2">
<h2 id="orga95f68b"><span class="section-number-2">3.</span> 二学年项目展 &lt;准备&gt;</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5b8e7a4" class="outline-3">
<h3 id="org5b8e7a4"><span class="section-number-3">3.1.</span> 示例</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Vue 音乐平台: <a href="https://blog.csdn.net/kzj0916/article/details/108663177">https://blog.csdn.net/kzj0916/article/details/108663177</a></li>
<li>Vue 仿猫眼: <a href="https://blog.csdn.net/Web_Struggle/article/details/85340402">https://blog.csdn.net/Web_Struggle/article/details/85340402</a></li>
<li>Vue 商城: <a href="https://blog.csdn.net/weixin_33873846/article/details/91434336?utm_medium=distribute.pc_relevant_bbs_down.none-task-blog-baidujs-2.nonecase&amp;depth_1-utm_source=distribute.pc_relevant_bbs_down.none-task-blog-baidujs-2.nonecase">https://blog.csdn.net/weixin_33873846/article/details/91434336?utm_medium=distribute.pc_relevant_bbs_down.none-task-blog-baidujs-2.nonecase&amp;depth_1-utm_source=distribute.pc_relevant_bbs_down.none-task-blog-baidujs-2.nonecase</a></li>
<li>Vue 仿小米商城: <a href="https://zhuanlan.zhihu.com/p/78088536">https://zhuanlan.zhihu.com/p/78088536</a></li>
<li>Vue 项目管理系统: <a href="https://cloud.tencent.com/developer/article/1345394">https://cloud.tencent.com/developer/article/1345394</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4ff133a" class="outline-3">
<h3 id="org4ff133a"><span class="section-number-3">3.2.</span> 需求文档</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://wenku.baidu.com/view/bd4813c958fb770bf78a55f6.html">https://wenku.baidu.com/view/bd4813c958fb770bf78a55f6.html</a></li>
</ul>
</div>
</div>
</section>


<section id="outline-container-org634d8f7" class="outline-2">
<h2 id="org634d8f7"><span class="section-number-2">4.</span> 二学年项目展 &lt;班级预展&gt;</h2>
<div class="outline-text-2" id="text-4">
<p>
2021.1.22 &lt;周五&gt;
</p>
</div>

<div id="outline-container-orgbd6342f" class="outline-3">
<h3 id="orgbd6342f"><span class="section-number-3">4.1.</span> 第一组: 海角论坛 (2.57)</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>只展示了 PPT，据说是因为投影仪接口问题</li>
<li>完成度不高</li>
</ul>
</div>
</div>

<div id="outline-container-orge66b222" class="outline-3">
<h3 id="orge66b222"><span class="section-number-3">4.2.</span> 第二组: 弃权?</h3>
<div class="outline-text-3" id="text-4-2">
<p>
???????????????
</p>
</div>
</div>

<div id="outline-container-org445c768" class="outline-3">
<h3 id="org445c768"><span class="section-number-3">4.3.</span> 第三组: 唯耳音乐 (4.42)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
功能:
</p>
<ul class="org-ul">
<li>游客 / 普通用户 / VIP 用户</li>
<li>(音乐/视频) 播放、收藏、评论、关注、付费功能、资源管理</li>
</ul>

<p>
点评:
</p>
<ul class="org-ul">
<li>需求文档/概要设计缺乏？明确做项目的目的、步骤</li>
<li>团队项目，要达到团队协作的目的和效果</li>
<li>细节需要完善，多借鉴相关竞品的产品设计 (站在巨人的肩膀上)</li>
<li>掌控好展示时间</li>
</ul>
</div>
</div>

<div id="outline-container-org0adfd43" class="outline-3">
<h3 id="org0adfd43"><span class="section-number-3">4.4.</span> 第四组: 校园墙 (2.28)</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>只有简陋的原型图？代码没落实</li>
<li>展示相当于什么都没展示</li>
</ul>
</div>
</div>

<div id="outline-container-org8018482" class="outline-3">
<h3 id="org8018482"><span class="section-number-3">4.5.</span> 第五组: 耳遇 (<a href="#org924fc76">3</a>.57)</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>PPT 做的比较漂亮</li>
<li>功能设计比较丰富 (专栏、MV、综艺、歌单等)</li>
<li>口头禅: 这里有 xxx 什么的</li>
<li>代码呢</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb13130" class="outline-3">
<h3 id="orgeb13130"><span class="section-number-3">4.6.</span> 第六组: 万国书店 (<a href="#org924fc76">3</a>.71)</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>万国太大，项目太小；需要做好后续</li>
<li>看起来需求是下过功夫的，但还是过于简单，并且功能缺失严重</li>
<li>应多借鉴其他的书籍网站</li>
</ul>
</div>
</div>

<div id="outline-container-org153bf64" class="outline-3">
<h3 id="org153bf64"><span class="section-number-3">4.7.</span> 第七组: 八戒蛋糕 (2.14)</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>需求分析是个啥？</li>
<li>时间都去哪儿了？</li>
</ul>
</div>
</div>

<div id="outline-container-org610a193" class="outline-3">
<h3 id="org610a193"><span class="section-number-3">4.8.</span> 第八组: 有问必答 (<a href="#org924fc76">3</a>.14)</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>展示不够完善</li>
</ul>
</div>
</div>
</section>






<section id="outline-container-org692ead6" class="outline-2">
<h2 id="org692ead6"><span class="section-number-2">5.</span> 二学年项目展 &lt;班级展&gt;</h2>
<div class="outline-text-2" id="text-5">
<p>
时间: 2021.03.01 &lt;星期一&gt;
</p>
</div>

<div id="outline-container-org1e38889" class="outline-3">
<h3 id="org1e38889"><span class="section-number-3">5.1.</span> 第一组: 海角论坛</h3>
<div class="outline-text-3" id="text-5-1">
<p>
只有 PPT? 完成度不高? 没有转接头?
</p>
</div>
</div>

<div id="outline-container-org9250c5b" class="outline-3">
<h3 id="org9250c5b"><span class="section-number-3">5.2.</span> 第二组: ???</h3>
<div class="outline-text-3" id="text-5-2">
<p>
只有登录和注册&#x2026;这不叫项目!
</p>
</div>
</div>

<div id="outline-container-orgdf2f8b3" class="outline-3">
<h3 id="orgdf2f8b3"><span class="section-number-3">5.3.</span> 第三组: 唯耳音乐</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>流程需要全面 (技术介绍、文档展示等)</li>
<li>讲解逻辑需要组织</li>
<li>讲解和展示需要默契</li>
<li>细节需要完善
<ul class="org-ul">
<li>共 '<a href="#org41c6646">8</a>' 条评论: 页面中文字不要用引号</li>
<li>分页尽量不要放到上面</li>
<li>没有权限访问的功能，菜单不需要显示出来</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4234c58" class="outline-3">
<h3 id="org4234c58"><span class="section-number-3">5.4.</span> 第四组: 校园墙</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>要按流程来: PPT、文档、展示&#x2026;</li>
<li>??????????????????????????????????????????</li>
</ul>
</div>
</div>

<div id="outline-container-org0362248" class="outline-3">
<h3 id="org0362248"><span class="section-number-3">5.5.</span> 第五组: 耳遇</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>。。。only ppt? only document?</li>
</ul>
</div>
</div>

<div id="outline-container-org3f57775" class="outline-3">
<h3 id="org3f57775"><span class="section-number-3">5.6.</span> 第六组: 万国书店</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>ppt 中错误: gosn -&gt; gson</li>
<li>需求文档，严肃的，白纸黑字</li>
<li>演讲逻辑乱; 演讲和展示不够默契</li>
<li>网页的主题颜色，用黑色，不要用灰色 (白纸黑字)</li>
<li>展示的正式场合，对一些数据进行稍微过滤，一些不太合适的内容删掉</li>
<li>有些页面太粗糙了</li>
</ul>
</div>
</div>

<div id="outline-container-org29d3d6f" class="outline-3">
<h3 id="org29d3d6f"><span class="section-number-3">5.7.</span> 第七组: 蛋糕</h3>
<div class="outline-text-3" id="text-5-7">
<p>
代码没到 ??????????????????????????????????????
</p>
</div>
</div>

<div id="outline-container-orgd1fec31" class="outline-3">
<h3 id="orgd1fec31"><span class="section-number-3">5.8.</span> 第八组: 有问必答</h3>
<div class="outline-text-3" id="text-5-8">
<p>
&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;.
&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;.
&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;.
&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;.
</p>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 悟饭</p>
<p class="date">Created: 2021-05-20</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
